views/site/register.php

                                    <div class="col-md-12">
                                        <div class="form-group">
                                            <?php
                                            $GolfCourse = GolfCourse::find()->all();
---
SELECT * FROM `golfcourse`

                                        <div class="form-group">
                                            <label for="field-4" class="control-label">Golfer Card Membership Category</label>
                                            <?php
                                            $CardMembershipCategory = CardMembershipCategory::find()->all();
---
SELECT * FROM `card_membership_category`