models/CountyQuery.php

SELECT * FROM `county`
---
    public function all($db = null)
    {
        return parent::all($db);