models/GolfCourse.php

SELECT * FROM `golfcourse`
---
    public function getAll() {
        return GolfCourse::find()->all();